STMicroelectronics/OpenOCD/src/flash/nor/spc58ng.c
		/* modeOp C55_MODE_OP_ERASE (0x1) */
		init_reg_param(&reg_params[1], "r4", 32, PARAM_IN);
		buf_set_u32(reg_params[1].value, 0, 32, C55_MODE_OP_ERASE);

		opResult = 0;
		err = target_write_buffer(target, checkStatus_working_area->address,
				8, (uint8_t *)&opResult);
		if (err != ERROR_OK){
			target_free_working_area(target, ssd_config);
			target_free_working_area(target, checkStatus_algorithm);

			target_free_working_area(target, erase_algorithm);
			target_free_working_area(target, erase_working_area);

			return err;
		}

		/* opResult */
		init_reg_param(&reg_params[2], "r5", 32, PARAM_IN_OUT);
		buf_set_u32(reg_params[2].value, 0, 32, checkStatus_working_area->address);

/*
		err = target_write_buffer(target, checkStatus_working_area_CtxData->address,
				sizeof(_c55_context_data), (uint8_t *)&opResult);
		if (err != ERROR_OK)
			return err;
*/
		init_reg_param(&reg_params[3], "r6", 32, PARAM_IN);
		buf_set_u32(reg_params[3].value, 0, 32, checkStatus_working_area_CtxData->address);


		/*
		 * Link register (in).
		 * Set link register to the breakpoint instruction at the end of the buffer.
		 * We use a software breakpoint to notify when done with algorithm execution.
		 */
		init_reg_param(&reg_params[4], "lr", 32, PARAM_IN);
		buf_set_u32(reg_params[4].value, 0, 32, checkStatus_algorithm->address + (sizeof(spc58x_flash_CheckStatus_code) - 2));

		init_reg_param(&reg_params[5], "r1", 32, PARAM_IN);
		buf_set_u32(reg_params[5].value, 0, 32, target->working_area_phys + target->working_area_size - 1);


		err = target_run_algorithm(target,
				0, NULL,
				6, reg_params,
				checkStatus_algorithm->address, (checkStatus_algorithm->address + checkStatus_algorithm->size),
				5000, &powerpc_info);




		if (err != ERROR_OK)  {
			err = ERROR_TARGET_FAILURE;
			target_free_working_area(target, checkStatus_algorithm);
			target_free_working_area(target, checkStatus_working_area);
			target_free_working_area(target, checkStatus_working_area_CtxData);

			target_free_working_area(target, erase_algorithm);
			target_free_working_area(target, erase_working_area);

			destroy_reg_param(&reg_params[0]);
			destroy_reg_param(&reg_params[1]);
			destroy_reg_param(&reg_params[2]);
			destroy_reg_param(&reg_params[3]);
			destroy_reg_param(&reg_params[4]);
			destroy_reg_param(&reg_params[5]);

			goto flash_erase_error;
		}

		opReturn = buf_get_u32(reg_params[0].value, 0, 32);
	}

	err = target_read_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);

	err = target_read_buffer(target, checkStatus_working_area->address,
				8, (uint8_t *)&opResult);

	if (opResult == C55_OK)
	{
		/* lock flash registers */
		for (i = first; i <= last; i++) {
			bank->sectors[i].is_erased = 1;
		}
	}
	else
	{
		err = ERROR_TARGET_FAILURE;
	}

	target_free_working_area(target, erase_algorithm);
	target_free_working_area(target, checkStatus_algorithm);
	target_free_working_area(target, checkStatus_working_area);
	target_free_working_area(target, checkStatus_working_area_CtxData);

	target_free_working_area(target, erase_working_area);

	destroy_reg_param(&reg_params[0]);
	destroy_reg_param(&reg_params[1]);
	destroy_reg_param(&reg_params[2]);
	destroy_reg_param(&reg_params[3]);
	destroy_reg_param(&reg_params[4]);
	destroy_reg_param(&reg_params[5]);


flash_erase_error:
	/* Free resources */
	target_free_working_area(target, ssd_config);

	return err;
}

static int spc58ng_protect(struct flash_bank *bank, int set, unsigned int first, unsigned int last)
{
	struct target *target = bank->target;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}

	return ERROR_OK;
}

/*offset = base address count = size */
static int spc58ng_write(struct flash_bank *bank, const uint8_t *buffer,
		uint32_t offset, uint32_t count)
{
	LOG_DEBUG("%s:%d %s()", __FILE__, __LINE__, __func__);
	LOG_DEBUG("%s:%d %s() offset = 0x%08x count = 0x%08x", __FILE__, __LINE__, __func__, offset, count);

	unsigned int i, sector = 0;

	for(i=0; i < bank->num_sectors; i++)
		LOG_DEBUG("-----> bank->sectors[%d].offset = 0x%08x (size = %d K)", i, bank->sectors[i].offset, (bank->sectors[i].size/1024));

	struct powerpc_algorithm powerpc_info;
	struct target *target = bank->target;
	struct spc58ng_flash_bank *spc58ng_info = bank->driver_priv;

	static struct working_area *source;
	struct working_area *write_algorithm;
	struct working_area *ssd_config;
	struct working_area *write_working_area_CtxData;
	struct working_area *checkStatus_algorithm;
	struct working_area *checkStatus_working_area;

	struct reg_param reg_params[8];
	SSD_CONFIG *ssd = &spc58ng_info->ssd;
	int err = ERROR_OK;


	uint32_t chunk_number;
	uint32_t bytes_remain;
	int32_t tot_sector = 0;
	uint32_t size = 0;
	uint32_t chunk_size = 0x400; /* internal buffer size 1024 bytes */

	uint32_t opResult;


	uint32_t loc_func;

	/* Set arch info */
	powerpc_info.common_magic = POWERPC_COMMON_MAGIC;

    if (count > chunk_size)
    {
    	size = chunk_size;
    	bytes_remain = count % chunk_size;
    	chunk_number = count / chunk_size;
    }
    else
    {
    	size = count;
    	bytes_remain = 0;
    	chunk_number = 1;
    }



	if (target->state != TARGET_HALTED) {
		LOG_ERROR("Target not halted");
		return ERROR_TARGET_NOT_HALTED;
	}


	for(i = 0; i < bank->num_sectors; i++)
	{
		if((offset >= bank->sectors[i].offset) && (offset < bank->sectors[i+1].offset)) {
			/* sector found */
			sector = i;
			tot_sector++;
			LOG_DEBUG("Sector found: %d IN_offset= 0x%08x, bank->sectors[%d].offset= 0x%08x, bank->sectors[%d].size= 0x%08x",
						  sector, offset, i, bank->sectors[i].offset, i, bank->sectors[i].size);

			LOG_DEBUG("bank->sectors[%d].size = %d",sector, bank->sectors[sector].size);
			LOG_DEBUG("bank->sectors[%d].offset = 0x%08x", sector, bank->sectors[sector].offset);
			LOG_DEBUG("bank->sectors[%d].is_erased = %d",sector, bank->sectors[sector].is_erased);
			LOG_DEBUG("bank->sectors[%d].is_protected = %d", sector, bank->sectors[sector].is_protected);

