STMicroelectronics/OpenOCD/src/flash/nor/spc58ng.c
			/* how many sectors */
			if(count > bank->sectors[sector].size)
			{
				uint32_t next_sect = sector;
				do
				{
					tot_sector++;
					next_sect++;
				}while(count > (bank->sectors[next_sect].offset + bank->sectors[next_sect].size));
			}
			break;
		}
	}



	/* SSD structure */
	if (target_alloc_working_area(target, sizeof(struct _c55_ssd_config),
			&ssd_config) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do SSD config allocation");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};

	err = target_write_buffer(target, ssd_config->address,
			sizeof(SSD_CONFIG), (uint8_t *)ssd);
	if (err != ERROR_OK)
		return err;

	/* unlock flash registers */
    // LOG_INFO("----> UNLOCK Flash");


	/* flash write code */
	if (target_alloc_working_area(target, sizeof(spc58x_flash_write_code),
			&write_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do block memory writes");
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};

	//pgmCtxData.pReqCompletionFn =  (PFLASHPROGRAM) write_algorithm->address;
	//buf_set_u32((uint8_t *)&loc_func, 0, 32,  buf_get_u32((uint8_t *) &(write_algorithm->address), 0, 32));

	loc_func = fast_target_buffer_get_u32((uint8_t *)&write_algorithm->address, false);

	err = target_write_buffer(target, write_algorithm->address,
			sizeof(spc58x_flash_write_code), (uint8_t *)spc58x_flash_write_code);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		return err;
	}

	/* memory buffer */
	if (target_alloc_working_area_try(target, chunk_size, &source) != ERROR_OK) {
		LOG_WARNING("no large enough working area available, can't do block memory writes");
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};


	/*if (target_alloc_working_area_try(target, sizeof(CONTEXT_DATA), &write_working_area_CtxData) != ERROR_OK) { */
	if (target_alloc_working_area_try(target, 36, &write_working_area_CtxData) != ERROR_OK) {
		LOG_WARNING("no large enough working area available, can't do block memory writes");
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		target_free_working_area(target, source);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};

/*	err = target_write_buffer(target, write_working_area_CtxData->address,
			sizeof(CONTEXT_DATA), (uint8_t *)&pgmCtxData);


	err = powerpc_write_memory_noturn(target, write_working_area_CtxData->address + 32,
			4, (uint8_t *)&write_algorithm->address);
*/
	err = target_write_buffer(target, write_working_area_CtxData->address + 32,
				32, (uint8_t *)&loc_func);

	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		target_free_working_area(target, source);
		target_free_working_area(target, write_working_area_CtxData);
		return err;
	}

	/* Flash checkStatus code */
	if (target_alloc_working_area(target, sizeof(spc58x_flash_CheckStatus_code),
				&checkStatus_algorithm) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do flash check status during erase step");
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
    	target_free_working_area(target, source);
	    target_free_working_area(target, write_working_area_CtxData);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	err = target_write_buffer(target, checkStatus_algorithm->address,
				sizeof(spc58x_flash_CheckStatus_code), (uint8_t *)spc58x_flash_CheckStatus_code);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		target_free_working_area(target, source);
		target_free_working_area(target, write_working_area_CtxData);
		target_free_working_area(target, checkStatus_algorithm);
		return err;
	}

	/* opResult */
	if (target_alloc_working_area(target, 4,
			&checkStatus_working_area) != ERROR_OK) {
		LOG_WARNING("no working area available, can't do get lock working area allocation");
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		target_free_working_area(target, source);
		target_free_working_area(target, write_working_area_CtxData);
		target_free_working_area(target, checkStatus_algorithm);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	};

	opResult = 0;
	err = target_write_buffer(target, checkStatus_working_area->address,
			4, (uint8_t *)&opResult);
	if (err != ERROR_OK) {
		target_free_working_area(target, ssd_config);
		target_free_working_area(target, write_algorithm);
		target_free_working_area(target, source);
		target_free_working_area(target, write_working_area_CtxData);
		target_free_working_area(target, checkStatus_algorithm);
		return ERROR_TARGET_RESOURCE_NOT_AVAILABLE;
	}

	for(i = 0; i < chunk_number; i++)
	{

		err = target_write_buffer(target, source->address,
				size, (uint8_t *)(buffer  + (i * chunk_size)));
		if (err != ERROR_OK) {
			target_free_working_area(target, ssd_config);
			target_free_working_area(target, write_algorithm);
			target_free_working_area(target, source);
			target_free_working_area(target, write_working_area_CtxData);
			target_free_working_area(target, checkStatus_algorithm);
			target_free_working_area(target, checkStatus_working_area);
			return err;
		}

		init_reg_param(&reg_params[0], "r3", 32, PARAM_IN_OUT);
		buf_set_u32(reg_params[0].value, 0, 32, ssd_config->address);

		/* factoryPgmFlag  - FALSE to do normal program. */
		init_reg_param(&reg_params[1], "r4", 32, PARAM_IN);
		buf_set_u32(reg_params[1].value, 0, 32, 0);

		/* dest */
		init_reg_param(&reg_params[2], "r5", 32, PARAM_IN);
		buf_set_u32(reg_params[2].value, 0, 32, bank->base + offset + (i * chunk_size));
		/* buf_set_u32(reg_params[2].value, 0, 32, 0xFC0000); */

		/* size */
		init_reg_param(&reg_params[3], "r6", 32, PARAM_IN);	/* size = 0x200 */
		buf_set_u32(reg_params[3].value, 0, 32, size);

		init_reg_param(&reg_params[4], "r7", 32, PARAM_IN);	/* source */
		buf_set_u32(reg_params[4].value, 0, 32, source->address);

		init_reg_param(&reg_params[5], "r8", 32, PARAM_IN);
		buf_set_u32(reg_params[5].value, 0, 32, write_working_area_CtxData->address);


